/*
 * ADCAttiny44a.c
 *
 * Created: 09.04.2021 15:52:53
 * Author : Leo
 */ 

#include <avr/io.h>


int main(void)
{
	//Порт А пин 3 на вход
    DDRA &= (0<<PINA0);
	//Настраиваем АЦП
	ADMUX=
	(0<<MUX0)|
	(0<<MUX1)|
	(0<<MUX2)|
	(0<<MUX3)|
	(0<<MUX4)|
	(0<<MUX5)| //выбираем пин 13 для ввода через мультиплексер
	(0<<REFS0)|
	(1<<REFS1)| //вибираем внутрений ИОН 1,1В
	(0<<ADLAR); //выравнивание справо
	
	ADCSRA|=
	(1<<ADEN)| //разрешаем работу АЦП
	(0<<ADPS2)|
	(1<<ADPS1)|
	(0<<ADPS0); //Устанавливаем прескейлер на 4
	// Запуск АЦП
	ADCSRA|=(1<<ADSC);
	
    while (1) 
    {
		OCR0A=ADCH
    }
}

